In [6]:
pip install seaborn

Collecting seaborn
  Using cached seaborn-0.10.0-py3-none-any.whl (215 kB)
Requirement already satisfied: matplotlib>=2.1.2 in ./py-env/lib/python3.7/site-packages (from seaborn) (3.1.3)
Requirement already satisfied: numpy>=1.13.3 in ./py-env/lib/python3.7/site-packages (from seaborn) (1.18.1)
Requirement already satisfied: pandas>=0.22.0 in ./py-env/lib/python3.7/site-packages (from seaborn) (1.0.1)
Requirement already satisfied: scipy>=1.0.1 in ./py-env/lib/python3.7/site-packages (from seaborn) (1.4.1)
Requirement already satisfied: python-dateutil>=2.1 in ./py-env/lib/python3.7/site-packages (from matplotlib>=2.1.2->seaborn) (2.8.1)
Requirement already satisfied: cycler>=0.10 in ./py-env/lib/python3.7/site-packages (from matplotlib>=2.1.2->seaborn) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in ./py-env/lib/python3.7/site-packages (from matplotlib>=2.1.2->seaborn) (1.1.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in ./py-env/lib/python3.7/site-packages (from matplotlib>=2.1.2->seaborn) (2.4.6)
Requirement already satisfied: pytz>=2017.2 in ./py-env/lib/python3.7/site-packages (from pandas>=0.22.0->seaborn) (2019.3)
Requirement already satisfied: six>=1.5 in ./py-env/lib/python3.7/site-packages (from python-dateutil>=2.1->matplotlib>=2.1.2->seaborn) (1.14.0)
Requirement already satisfied: setuptools in ./py-env/lib/python3.7/site-packages (from kiwisolver>=1.0.1->matplotlib>=2.1.2->seaborn) (40.8.0)
Installing collected packages: seaborn
Successfully installed seaborn-0.10.0
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
sns.set(style="darkgrid")

In [3]:
df = pd.read_csv('fortune500.csv')

In [6]:
df.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [8]:
df.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584